
Процедура КнопкаВыполнитьНажатие(Кнопка)
	Если ЗначениеЗаполнено(Справочники.БИТ_ЗаменаКонстант.РазрешениеНаЗапускSPOT2D.Значение) Тогда
		Если  Справочники.БИТ_ЗаменаКонстант.РазрешениеНаЗапускSPOT2D.Значение Тогда
			Если ВыгрузитьДанныеВCSVНаФайловыйРесурс Тогда 
				ВыгрузкаДанныхДляSPOT2D.ВыгрузитьДанныеВCSVНаФайловыйРесурс();
			КонецЕсли;
			Если ОтправитьДанныеВSpot2D Тогда
				ВыгрузкаДанныхДляSPOT2D.ОтправитьДанныеВSpot2D();
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	ВыгрузитьДанныеВCSVНаФайловыйРесурс = ИСТИНА;
	ОтправитьДанныеВSpot2D = Ложь;
	
КонецПроцедуры
