
Процедура КнопкаВыполнитьНажатие(Кнопка)
	Если Справочники.БИТ_ЗаменаКонстант.РазрешениеНаЗапускSPOT2D.Значение <> Неопределено Тогда
		Если  Справочники.БИТ_ЗаменаКонстант.РазрешениеНаЗапускSPOT2D.Значение Тогда
			МассивКаталогов = ПолучитьМассивКаталогов();
			Если ВыгрузитьДанныеВCSVНаФайловыйРесурс Тогда 
				ВыгрузкаДанныхДляSPOT2D.ВыгрузитьДанныеВCSVНаФайловыйРесурс();
			КонецЕсли;
			Если ОтправитьДанныеВSpot2D Тогда
				ВыгрузкаДанныхДляSPOT2D.ОтправитьДанныеВSpot2D();
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

Функция ПолучитьМассивКаталогов()
	МассивН = Новый Массив();
	МассивН.Добавить(Справочники.Номенклатура.НайтиПоКоду("УТ000006216")); //Bauerfeind
	МассивН.Добавить(Справочники.Номенклатура.НайтиПоКоду("УТ000019773")); //Bauerfeind гольфы 1кк
	МассивН.Добавить(Справочники.Номенклатура.НайтиПоКоду("УТ000019774")); //Bauerfeind гольфы 2кк
	МассивН.Добавить(Справочники.Номенклатура.НайтиПоКоду("УТ000019775")); //Bauerfeind колготки 1кк
	МассивН.Добавить(Справочники.Номенклатура.НайтиПоКоду("УТ000019776")); //Bauerfeind колготки 2кк"));
	МассивН.Добавить(Справочники.Номенклатура.НайтиПоКоду("УТ000019935")); //Bauerfeind ортезы"));
	МассивН.Добавить(Справочники.Номенклатура.НайтиПоКоду("УТ000019936")); //Bauerfeind стельки"));
	МассивН.Добавить(Справочники.Номенклатура.НайтиПоКоду("УТ000019778")); //Bauerfeind чулки 1кк"));
	МассивН.Добавить(Справочники.Номенклатура.НайтиПоКоду("УТ000019779")); //Bauerfeind чулки 2кк"));
	МассивН.Добавить(Справочники.Номенклатура.НайтиПоКоду("УТ000011329")); //Bronigen"));
	МассивН.Добавить(Справочники.Номенклатура.НайтиПоКоду("УТ000016995")); //Kinerapy"));
	МассивН.Добавить(Справочники.Номенклатура.НайтиПоКоду("УТ000021220")); //Nrg"));
	МассивН.Добавить(Справочники.Номенклатура.НайтиПоКоду("УТ000011327")); //Orlett"));
	МассивН.Добавить(Справочники.Номенклатура.НайтиПоКоду("УТ000011335")); //Philadelphia"));
	МассивН.Добавить(Справочники.Номенклатура.НайтиПоКоду("УТ000006302")); //Push"));
	МассивН.Добавить(Справочники.Номенклатура.НайтиПоКоду("УТ000011330")); //Togu"));
	МассивН.Добавить(Справочники.Номенклатура.НайтиПоКоду("УТ000011332")); //Trelax"));
	МассивН.Добавить(Справочники.Номенклатура.НайтиПоКоду("УТ000007836")); //Venoteks гольфы"));
	МассивН.Добавить(Справочники.Номенклатура.НайтиПоКоду("УТ000007835")); //Venoteks колготы"));
	МассивН.Добавить(Справочники.Номенклатура.НайтиПоКоду("УТ000006218")); //Venoteks чулки"));
	МассивН.Добавить(Справочники.Номенклатура.НайтиПоКоду("УТ000012965")); //НИКАМЕД стельки"));
	МассивН.Добавить(Справочники.Номенклатура.НайтиПоКоду("УТ000022838")); //НИКАМЕД товары"));
	МассивН.Добавить(Справочники.Номенклатура.НайтиПоКоду("УТ000022840")); //НИКАМЕД приспособление"));
	МассивН.Добавить(Справочники.Номенклатура.НайтиПоКоду("УТ000012966")); //Обувь Ortmann"));
	МассивН.Добавить(Справочники.Номенклатура.НайтиПоКоду("УТ000019296")); //Обувь Ortmann kids"));
	МассивН.Добавить(Справочники.Номенклатура.НайтиПоКоду("УТ000008302")); //Обувь Германии"));
	Возврат МассивН;
КонецФункции


Процедура ПриОткрытии()
	
	ВыгрузитьДанныеВCSVНаФайловыйРесурс = ИСТИНА;
	ОтправитьДанныеВSpot2D = Ложь;
	
КонецПроцедуры
